package grand_final;

public class Task1 {


    /**
     * Игра
     */

    // 0,1;0,2;0,3;0,4
/*0,1;0,2;0,3;0,4
    Введите координаты трехпалубный № 1
            2,1;2,2;2,3
    Введите координаты трехпалубный № 2
            4,1;4,2;4,3
    Введите координаты двухпалубный № 1
            6,1;6,2
    Введите координаты двухпалубный № 2
            8,1;8,2


            0,1;0,2;0,3;0,4
Введите координаты трехпалубный № 1
2,1;2,2;2,3
Введите координаты трехпалубный № 2
4,1;4,2;4,3
Введите координаты двухпалубный № 1
5,1;5,2;5,3

//2,3;3,3;4,3;5,3
//6,0;7,0;8,0
//6,5;6,6;6,7
//0,8;0,9
//7,2;8,2
//5,0;5,1
//4,0;4,1
//0,0
//9,9
//3,6
//0,2

//0,0;0,1;0,2;0,3
//4,0;5,0;6,0
//4,3;4,4;4,5
//7,9;8,9
//9,0;9,1
//1,8;2,8
//2,6
//7,5
//9,5
//2,2

*/
    public static void main(String[] args) {

        Player player1 = new Player("Вася");
        Player player2 = new Player("Петя");

        Game game = new Game(player1, player2);
        game.start();

        System.out.println("Доска игрока " + player1.getName());
        player1.getBoard().print();
        System.out.println("Доска игрока " + player2.getName());
        player2.getBoard().print();


    }


}
